[
  {
    "title": "Обо мне",
    "text": [
      "Я фронтенд разработчик (React), ищу интересный проект и дружный коллектив. Более двух лет изучаю фронтенд. Более года коммерческого опыта, в команде разрабатывали многостраничные сайты для международных клиентов. Мои сильные стороны — это умение структурировать задачи, расставлять приоритеты, быть гибким и брать на себя ответственность. Живу в России, г. Ярославль."
    ]
  },

  {
    "title": "Опыт работы",
    "miniTitle": [
      "Frontend-разработчик (React)",
      "ООО «Парус» (Июль 2023 — август 2024) - 1 год 2 месяца"
    ],
    "text": [
      "- Разработка и поддержка кросс-браузерных адаптивных многостраничных сайтов для международных клиентов, включая медицинские клиники, туристические агентства, фитнес центры, с использованием стека: Next.js, React, TypeScript, Redux Toolkit, SCSS, Ant Design, Vitest.",
      "- Командная работа (Kanban). Взаимодействие с менеджерами, дизайнерами, QA и другими членами команды.",
      "- Разработка с нуля компонентов, с учётом требований дизайна, для дальнейшего использования в проектах, таких как формы для сбора пользовательских данных, слайдеры, чат с виртуальным ассистентом, использующим дерево диалогов для автоматического взаимодействия с пользователями, UI kit.",
      "- Работа с многоязычными проектами: английский, французский, арабский, филиппинский. Реализация i18n.",
      "- Написание модульных тестов с использованием Vitest для обеспечения поддерживаемости."
    ]
  },

  {
    "miniTitle": [
      "Менеджер проектов",
      "ООО «Скай Ай Ти» (Сентябрь 2020 — июль 2023) - 2 года 11 месяцев"
    ],
    "text": [
      "- Ведение ИТ проектов",
      "- Переговоры с заказчиками",
      "- Управление внутренними процессами для выполнения обязательств перед заказчиками"
    ]
  },

  {
    "title": "Навыки",
    "text": [
      "Языки: JavaScript, TypeScript, HTML, CSS, SCSS.",
      "Фреймворки: React, Next.js.",
      "Библиотеки: Redux, Redux-Toolkit, Ant Design.",
      "Сборщики: Vite, WebPack.",
      "Инструменты для тестирования: Vitest, Jest.",
      "Другие: Git/GitHub, GitHub Projects."
    ]
  },

  {
    "title": "Образование",
    "text": ["Московский финансово-юридический университет (МФЮА) - Менеджер проектов"]
  },

  {
    "title": "Курсы повышения квалификации",
    "links": [
      {
        "title": "Frontend-developer, The Rolling Scopes School (EPAM)",
        "url": "https://app.rs.school/certificate/02rqb9xm"
      },
      {
        "title": "React-developer, The Rolling Scopes School (EPAM)",
        "url": "https://app.rs.school/certificate/02rqb9xm"
      }
    ]
  }
]
